src/Catalogs/Контрагенты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>Контрагенты</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЮридическоеФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЮридическоеФизическоеЛицо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КПП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОГРН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументУдостоверяющийЛичность</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойДоговор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/Контрагенты/Forms/ФормаЭлементаУправляемая/Ext/Form/Module.bsl
&НаКлиенте
Процедура Команда1(Команда)
	Команда1НаСервере();
КонецПроцедуры

&НаСервере
Процедура Команда1НаСервере()
	
	СправчникОбъект = РеквизитФормыВЗначение("Объект");
	СправчникОбъект.ФорматироватьНаименование();
	ЗначениеВРеквизитФормы(СправчникОбъект,"Объект");
	
	СправчникОбъект = ДанныеФормыВЗначение(Объект,Тип("СправочникОбъект.Контрагенты"));
	СправчникОбъект.ФорматироватьНаименование();
	ЗначениеВДанныеФормы(СправчникОбъект,Объект);
	
КонецПроцедуры

//&НаКлиенте
//Процедура УстановитьВидимостьПолей()
//	
//	Если Объект.ЮридическоеФизическоеЛицо = ПредопределенноеЗначение("Перечисление.ЮридическоеФизическоеЛицо.ЮридическоеЛицо") Тогда
//		Элементы.ДокументУдостоверяющийЛичность.Видимость = Ложь;
//		Элементы.КПП.Видимость = Истина;
//		Элементы.ОГРН.Видимость = Истина;
//	Иначе
//		Элементы.ДокументУдостоверяющийЛичность.Видимость = Истина;
//		Элементы.КПП.Видимость = Ложь;
//		Элементы.ОГРН.Видимость = Ложь;
//	КонецЕсли;     
//	
//КонецПроцедуры // ()

&НаКлиенте
Процедура ЮридическоеФизическоеЛицоПриИзменении(Элемент)
	УстановитьВидимостьПолей();
КонецПроцедуры

//&НаКлиенте
//Процедура ПриОткрытии(Отказ)
//	УстановитьВидимостьПолей();
//КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьПолей()
	
	Если Объект.ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ЮридическоеЛицо Тогда
		Элементы.ДокументУдостоверяющийЛичность.Видимость = Ложь;
		Элементы.КПП.Видимость = Истина;
		Элементы.ОГРН.Видимость = Истина;
	Иначе
		Элементы.ДокументУдостоверяющийЛичность.Видимость = Истина;
		Элементы.КПП.Видимость = Ложь;
		Элементы.ОГРН.Видимость = Ложь;
	КонецЕсли;

КонецПроцедуры // ()

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УстановитьВидимостьПолей();
КонецПроцедуры
